Autodesk.Revit.DB.Electrical.CircuitNaming
An enumerated type listing all the circuit naming options.
Since:
2021

Autodesk.Revit.DB.Electrical.CircuitNaming.Customized
Circuit naming is user defined.

Autodesk.Revit.DB.Electrical.CircuitNaming.ProjectSetting
Circuit naming is By Project Setting.

Autodesk.Revit.DB.Electrical.CircuitNaming.Phase
Circuit naming is By Phase.

Autodesk.Revit.DB.Electrical.CircuitNaming.PanelName
Circuit naming is Panel Name.

Autodesk.Revit.DB.Electrical.CircuitNaming.Standard
Circuit naming is Standard.

Autodesk.Revit.DB.Electrical.CircuitNaming.Prefixed
Circuit naming is Prefixed.

Autodesk.Revit.DB.Electrical.CircuitNaming.Undefined
Circuit naming is Undefined.